text/chart_style/tdd_hello/2nd_hello_tdd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>second lesson for ruby novice &#x2013; hello method with tdd --</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">second lesson for ruby novice &#x2013; hello method with tdd --</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5e83c47">1. 答えを先に</a>
<ul>
<li><a href="#org9e424b2">1.1. 振る舞いを考える</a></li>
<li><a href="#orgc7ff3b6">1.2. まずは，greetings</a></li>
<li><a href="#org434090a">1.3. 次は，gets name</a></li>
<li><a href="#org4f8d669">1.4. 最後はhello name</a></li>
</ul>
</li>
<li><a href="#org9e19dc7">2. TDD</a>
<ul>
<li><a href="#orgd37a45d">2.1. codingの最終目標</a></li>
<li><a href="#org0fdc979">2.2. clean code that works</a></li>
<li><a href="#org0a4d789">2.3. phases and speed</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5e83c47" class="outline-2">
<h2 id="org5e83c47"><span class="section-number-2">1</span> 答えを先に</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9e424b2" class="outline-3">
<h3 id="org9e424b2"><span class="section-number-3">1.1</span> 振る舞いを考える</h3>
<div class="outline-text-3" id="text-1-1">
<p>
methodで隠蔽するというのはわかりましたでしょうか？
さらに，うまいこと単語を選べばコードが読み易くなります．
</p>

<p>
今日は，codingを強力に進めるテスト駆動を入れていきます．
それには，自然言語を駆使しましょう．
英語でhelloの会話を考えましょう．
</p>
<pre class="example">
Hi, What's your name?
bob.
Hello, bob. Nice to meet you.
</pre>
<p>
ですよね．
</p>

<p>
これを分析すると，
</p>
<ol class="org-ol">
<li>greetings</li>
<li>gets name</li>
<li>hello name</li>
</ol>
<p>
って感じでしょ．
</p>

<p>
そういう風にmethodを作っていきましょう．
</p>
</div>
</div>
<div id="outline-container-orgc7ff3b6" class="outline-3">
<h3 id="orgc7ff3b6"><span class="section-number-3">1.2</span> まずは，greetings</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
&gt; emacs hello_tdd.rb
greetings # C-x C-s C-z
&gt; ruby hello_tdd.rb
</pre>
<p>
として動かしてみましょう．そうすると
</p>
<pre class="example">
hello_tdd.rb:1:in `&lt;main&gt;': undefined local variable or method `greetings' for main:Object (NameError)
</pre>
<p>
と返ってきますよね．greetingsというmethodがないよ．
では，作ります．
</p>
<pre class="example">
&gt; fg
def greetings
end
</pre>
<p>
そうするとエラーはなくなります．でも，何も表示されないですよね．
そこで，振る舞いを持たせて，
</p>
<pre class="example">
def greetings
  puts "Hello. I\'m mac. Who are you?"
end
</pre>
<p>
これでgreetingsの完成です．
</p>
</div>
</div>

<div id="outline-container-org434090a" class="outline-3">
<h3 id="org434090a"><span class="section-number-3">1.3</span> 次は，gets name</h3>
<div class="outline-text-3" id="text-1-3">
<p>
ですが，これを書いちゃうと
</p>
<pre class="example">
name = gets.chomp
</pre>
<p>
となります．
</p>
</div>
</div>

<div id="outline-container-org4f8d669" class="outline-3">
<h3 id="org4f8d669"><span class="section-number-3">1.4</span> 最後はhello name</h3>
<div class="outline-text-3" id="text-1-4">
<p>
です．そのまま書くと，
</p>
<pre class="example">
name = gets.chomp
hello name
</pre>
<pre class="example">
hello_tdd.rb:7:in `&lt;main&gt;': undefined method `hello' for main:Object (NoMethodError)

</pre>
<p>
と怒られます．そこでhello methodを作っていきます．
少し試行錯誤すると，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">hello</span>(name)
  puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{name}</span><span style="font-style: italic;">.  How are you?"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
とでもなったでしょうか．
</p>
</div>
</div>
</div>

<div id="outline-container-org9e19dc7" class="outline-2">
<h2 id="org9e19dc7"><span class="section-number-2">2</span> TDD</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd37a45d" class="outline-3">
<h3 id="orgd37a45d"><span class="section-number-3">2.1</span> codingの最終目標</h3>
<div class="outline-text-3" id="text-2-1">
<p>
こういうcodingの仕方はTDD(Test Driven Development:テスト駆動開発)
と呼ばれています．
</p>

<ul class="org-ul">
<li>テストを作る</li>
<li>エラーを出す(red)</li>
<li>エラーをなくす(green)</li>
<li>codeを綺麗にする(refactoring)</li>
</ul>
<p>
です．codingの最終目標は
</p>
<pre class="example">
clean code that works

</pre>
<p>
動く綺麗なコードを作ることです．
えっと，もし，あなたが，
</p>
<ul class="org-ul">
<li>codeを書くまえに設計すべき</li>
<li>コピペは悪</li>
</ul>
<p>
なんていう，マントラを信じているなら
このprogramming styleを提唱し始めたKent Beckの文章を
載せておきます．よーーく心に刻んでください．
もしあなたがプログラミング嫌いならば，
少し心が晴れると思いますよ．俺のせいじゃないって．
</p>
</div>
</div>

<div id="outline-container-org0fdc979" class="outline-3">
<h3 id="org0fdc979"><span class="section-number-3">2.2</span> clean code that works</h3>
<div class="outline-text-3" id="text-2-2">
<p>
TDD by Example (Kent Beck) p.13
</p>
<blockquote>
<p>
目指すのは，動作するきれいなコードだ
(このRon Jeffriesの簡潔な表現は素晴らしい).
動作するきれいなコードは，偉大なプログラマでも
すぐには書けないことがあるし，
普通のプログラマならなおさらだ(私もそうだ)．
ここは分割統治しよう．
最初に「動作する」に取り組み，
その後で「きれいな」に取り組む．
この方法はアーキテクチャ駆動とは正反対だ．
アーキテクチャ駆動は「きれいな」に最初に取り組み，
そのうえで苦心してあちこち設計の辻褄を
合わせながらどうにか「動作する」を実現させる．
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org0a4d789" class="outline-3">
<h3 id="org0a4d789"><span class="section-number-3">2.3</span> phases and speed</h3>
<div class="outline-text-3" id="text-2-3">
<p>
TDD by Example (Kent Beck) p.30
</p>
<blockquote>
<p>
グリーンバーを出す小さなステップはどんなものだろうか．
Dollarクラスを丸ごとコピーして，
DollarをFrancに書き換えるのはどうだろう．
</p>

<p>
ちょっと待った．
これで唾棄すべき糞コードの出来上がりだと
あざ笑う声が聞こえる．
その声は続けて言う．
コピー&amp;ペーストによる再利用は
抽象化の敗北であり，きれいな設計を殺すと．
</p>

<p>
イラっとしただろうか．なら深呼吸だ．
鼻から息を吸い込んで，3秒止めて口から吐き出す．
オーケー？
さて，サイクルにはフェーズがあることを思い出してほしい
(中には数秒で通り過ぎるものもあるが，フェーズはフェーズだ)．
</p>
<ol class="org-ol">
<li>テストを書く．</li>
<li>コンパイラを通す．</li>
<li>テストを走らせ，失敗を確認する．</li>
<li>テストを通す．</li>
<li>重複を排除する．</li>
</ol>


<p>
各フェーズにはフェーズなりの目的と解決法があり，
価値観も異なっている．
最初の３つのフェーズはなるべく速く通過して，
新しい機能がどの状態にあるのかわかるところまで行きたい．
そこにたどり着くためには，どのような罪をおかしてもよい．
その短い時間だけは，速度が設計よりも重要だからだ．
</p>

<p>
１つ心配なのは，私がここに書いていることが，
良い設計の原則を無視してよいという免罪符になってしまうことだ．
チームに対して
「Kent Beckが設計なんてどうでもいいって書いてたよ」
などと言い始めるのは，ちょっと待ってほしい．
サイクルはまだ終わっていない．
4つ足のアーロンチェアは倒れる．
最初の4つのステップは，5つ目がなければ無意味だ．
正しい設計を，正しいタイミングで行う．
動かしてから，正しくする．
</p>

<p>
ここまで言っておけば安心だろう．
これで読者の皆さんは重複を排除するまで
誰にもコードを見せないはずだ
(ただし，ペアプロ相手は除く)
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
